In [1]:
import pandas as pd
import functions as fnc
import variables as var
#import plot_features_num_regression as function

In [2]:
df = pd.read_csv("titanic.csv")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
def plot_features_cat_regression(dataframe, target_col = "", columns = [], pvalue = 0.05, with_individual_plot = False):

    """
        Pinta los histogramas agrupados de la variable target_col para cada uno de los valores de columns, siempre y cuando el test de significaciÃ³n sea 1-pvalue. 
        Si columns no tiene valores, se pintarÃ¡n los histogramas de las variables numÃ©ricas teniendo en cuenta lo mismo.

        Argumentos:
        dataframe (DataFrame): dataframe a estudiar.
        target_col (str): nombre de la columna con los datos target.
        columns (list): lista con el nombre de las columnas a comparar con target_col.
        pvalue (float64): valor p.
        with_individual_plot (bool): si es True pinta cada histograma por separado.

        Retorna:
        tipo: DescripciÃ³n de lo que retorna la funciÃ³n. COMPLETAR
        """

La columna 'alives' no existe en el dataframe
Las siguientes columnas no existen en el dataframe: ['dd', 'bb']
Las siguientes columnas no son del tipo ['CategÃ³rica', 'Binaria']: ['age', 'fare']

False

In [5]:
fnc.is_valid_params(df, "alive", ["fare","age"], target_type="Binaria", columns_type=["NumÃ©rica Discreta"])

True